---
kind: property
id: P:Autodesk.Revit.UI.TextEditorOptions.ShowBorder
source: html/0784bf7e-e283-e7f9-9944-001a61d889b1.htm
---
# Autodesk.Revit.UI.TextEditorOptions.ShowBorder Property

Show the border box around the text during editing.

## Syntax (C#)
```csharp
public bool ShowBorder { get; set; }
```

## Remarks
If false, the border will appear or not depending on the edited text note's type Show Border setting.
 If true, the border will always appear during editing regardless of type settings.